create_clock -name "clk" -period 0.7 -waveform {0 0.35} {clk}
set_dont_touch_network clk

set_dont_touch_network reset
set_ideal_network reset
